/*Програма обчислює та виводить резьтат на екран таких дій: залишок від ділення 2-го числа на 1-е; 
цілу частину від ділення 1-го числа на 2-е; добуток чисел.*/
#include <stdio.h>
#include <math.h>

int main() {
    int a, b; //оголошуємо змінні
    int remainder, quotient, product; 

    printf("Введіть два цілих числа:");
    scanf("%d %d", &a, &b); //Введення змінних
    remainder=b%a; //обчислюємо залишок
    quotient=a/b; //обчислюємо цілу частину від ділення 1-го числа на 2-е 
    product=a*b; //обчислюємо добуток

    printf("Залишок від ділення 2-го числа на 1-е: %d\n", remainder);
    printf("Ціла частина від ділення 1-го числа на 2-е: %d\n", quotient);
    printf("Добуток чисел: %d\n", product); //Виведення результату

    return 0; //кінець програми

}